Revit 2027 API
RevitAPIEventArgs.IsCancelled Method
 Indicates whether the event is being cancelled.
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsCancelled()
Public Function IsCancelled As Boolean
public:
bool IsCancelled()
member IsCancelled : unit -> bool
Return Value
Boolean
Remarks
 If the event is cancellable and an event delegate wishes to cancel the event, it may call the Cancel() method if it is available for a particular event's arguments.
See Also
Reference
RevitAPIEventArgs Class
Autodesk.Revit.DB.Events Namespace